Repository: 0xhotchocolate/xrpl-dev-portal
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: hi

source: Individual consumers can use XRP to move different currencies around the world. For example, through wallets and exchanges that use <a href="https://paystring.org/" target="_blank">PayID</a>, anyone can use XRP—or any currency, be it fiat or digital assets—to easily make purchases across any payments network.
hi: अलग-अलग उपभोक्ता दुनिया भर में विभिन्न मुद्राओं को स्थानांतरित करने के लिए एक्सआरपी का उपयोग कर सकते हैं। उदाहरण के लिए, वॉलेट और एक्सचेंजों के माध्यम से जो <a href=https://paystring.org/ target=_blank>PayID</a> का उपयोग करते हैं, कोई भी XRP—या किसी भी मुद्रा का उपयोग कर सकता है, चाहे वह कानूनी संपत्ति हो या डिजिटल संपत्ति —किसी भी भुगतान नेटवर्क पर आसानी से खरीदारी करने के लिए।

source: More About Uses
hi: उपयोग के बारे में अधिक

source: Developers
hi: डेवलपर्स

source: By building on the XRP Ledger, developers can easily integrate payments into their products—seamlessly putting money at the center of their applications. Projects like <a href="https://github.com/XRPLF/xrpl-py" target="_blank">xrpl-py</a> are making it easier for developers to leverage XRP.
hi: एक्सआरपी लेजर पर निर्माण करके, डेवलपर्स आसानी से अपने उत्पादों में भुगतान को एकीकृत कर सकते हैं-मूल रूप से अपने अनुप्रयोगों के केंद्र में पैसा डालते हैं। <a href=https://github.com/XRPLF/xrpl-py target=_blank>xrpl-py</a> जैसी परियोजनाएं डेवलपर्स के लिए XRP का लाभ उठाना आसान बना रही हैं।

source: More About Developers
hi: डेवलपर्स के बारे में

source: Internet of Value
hi: मूल्य का इंटरनेट

source: The XRP Ledger settles transactions faster than any other blockchain—in 3-5 seconds.
hi: एक्सआरपी लेजर किसी भी अन्य ब्लॉकचेन की तुलना में 3-5 सेकंड में लेनदेन को तेजी से निपटाता है।

source: XRP transactions cost a fraction of a penny ($0.0002)—much less than other cryptocurrencies and average fiat payments.
hi: एक्सआरपी लेनदेन में एक पैसा ($ 0.0002) का एक अंश खर्च होता है - अन्य क्रिप्टोकरेंसी और औसत कानूनी भुगतानों की तुलना में बहुत कम।

source: The XRP Ledger can handle up to 1,500 transactions per second.
hi: XRP लेजर प्रति सेकंड 1,500 लेनदेन तक संभाल सकता है।

source: XRP transactions settle without the enormous and unsustainable energy costs associated with proof-of-work (or mining).
hi: XRP लेन-देन प्रूफ-ऑफ-वर्क (या माइनिंग) से जुड़ी भारी और अस्थिर ऊर्जा लागतों के बिना निपटता है।

source: Real
hi: असली

source: XRP is one of the only digital assets with a proven, real-world use case: cross-border payments.
hi: XRP एकमात्र ऐसी डिजिटल संपत्ति में से एक है, जो एक सिद्ध, वास्तविक दुनिया के उपयोग के मामले में है: सीमा पार से भुगतान।

source: Trading
hi: व्यापार

source: How Is XRP Used in Trading?
hi: ट्रेडिंग में एक्सआरपी का उपयोग कैसे किया जाता है?

source: XRP is traded on more than 140 markets and <a href="exchanges.html">exchanges</a> worldwide.
hi: XRP का दुनिया भर में 140 से अधिक बाजारों और <a href=exchanges.html>एक्सचेंजों</a> में कारोबार होता है।

source: XRP’s low transaction fees, reliability and high speed enable traders to use the digital asset as fast, cost-efficient and reliable collateral across trading venues—<a href="https://ripple.com/insights/xrp-a-preferred-base-currency-for-arbitrage-trading/" target="_blank">seizing arbitrage opportunities</a>, servicing margin calls and managing general trading inventory in real time.
hi: एक्सआरपी की कम लेनदेन शुल्क, विश्वसनीयता और उच्च गति व्यापारियों को डिजिटल संपत्ति का उपयोग व्यापारिक स्थानों पर तेज, लागत प्रभावी और विश्वसनीय संपार्श्विक के रूप में करने में सक्षम बनाती है—<a href=https://ripple.com/insights/xrp-a-preferred- बेस-करेंसी-फॉर-आर्बिट्रेज-ट्रेडिंग/ target=_blank>आर्बिट्रेज के अवसरों को जब्त करना</a>, मार्जिन कॉल की सर्विसिंग और वास्तविक समय में सामान्य ट्रेडिंग इन्वेंट्री का प्रबंधन करना।

source: Because of the properties inherent to XRP and the ecosystem around it, traders worldwide are able to shift collateral, bridge currencies and switch from one crypto into another nearly instantly, across any exchange on the planet.
hi: एक्सआरपी और उसके आसपास के पारिस्थितिकी तंत्र में निहित गुणों के कारण, दुनिया भर के व्यापारी ग्रह पर किसी भी एक्सचेंज में संपार्श्विक, पुल मुद्राओं को स्थानांतरित करने और एक क्रिप्टो से दूसरी क्रिप्टो में स्विच करने में सक्षम हैं।

source: Find Out More
hi: और अधिक जानकारी प्राप्त करें

source: Ripple vs. XRP
hi: रिपल बनाम एक्सआरपी

source: What Is the Relationship Between Ripple and XRP?
hi: रिपल और एक्सआरपी के बीच क्या संबंध है?

source: Ripple is a technology company that makes it easier to build a high-performance, global payments business through its platform, RippleNet. XRP is a digital asset independent of this, and is used in Ripple’s On-Demand Liquidity service to facilitate efficient and cost-effective cross-border transactions. In December of 2017, Ripple placed 55 Billion XRP into a cryptographically secured <a href="https://ripple.com/insights/explanation-ripples-xrp-escrow/" target="_blank">escrow</a> account to support stable and healthy <a href="https://ripple.com/xrp/market-performance" target="_blank">XRP markets</a>.
hi: Ripple एक प्रौद्योगिकी कंपनी है जो अपने प्लेटफॉर्म RippleNet के माध्यम से एक उच्च-प्रदर्शन, वैश्विक भुगतान व्यवसाय बनाना आसान बनाती है। एक्सआरपी इससे स्वतंत्र एक डिजिटल संपत्ति है, और इसका उपयोग कुशल और लागत प्रभावी सीमा पार लेनदेन की सुविधा के लिए रिपल की ऑन-डिमांड तरलता सेवा में किया जाता है। 2017 के दिसंबर में, Ripple ने क्रिप्टोग्राफ़िक रूप से सुरक्षित <a href=https://ripple.com/insights/explanation-ripples-xrp-escrow/ target=_blank>एस्क्रो</a> खाते में 55 बिलियन XRP रखा। स्थिर और स्वस्थ <a href=https://ripple.com/xrp/market-performance target=_blank>XRP बाजारों</a> का समर्थन करने के लिए।

source: Visit Ripple's Website
hi: रिपल की वेबसाइट पर जाएँ

source: XRP Community
hi: एक्सआरपी समुदाय

source: XRPL.org: For the Community, by the Community
hi: XRPL.org: समुदाय के लिए, समुदाय द्वारा

source: XRPL.org is a community-driven resource for all things XRP and XRP Ledger (XRPL). If you’d like to suggest additional information around XRP, you can suggest changes <a href="contribute.html">here</a>.
hi: XRPL.org सभी चीजों के लिए XRP और XRP लेजर (XRPL) के लिए एक समुदाय-संचालित संसाधन है। यदि आप XRP के बारे में अतिरिक्त जानकारी का सुझाव देना चाहते हैं, तो आप <a href=contribute.html>यहां</a> परिवर्तनों का सुझाव दे सकते हैं।

source: Suggest Changes
hi: परिवर्तन सुझाएं

source: The Best Way To Move Money Around the World
hi: दुनिया भर में पैसा स्थानांतरित करने का सबसे अच्छा तरीका

source: Using XRP
hi: एक्सआरपी का उपयोग करना

source: XRP and the XRP Ledger are used to power innovative technology across the payments space.
hi: एक्सआरपी और एक्सआरपी लेजर का उपयोग भुगतान क्षेत्र में नवीन प्रौद्योगिकी को शक्ति प्रदान करने के लिए किया जाता है।

source: From cross-border payments to decentralized finance, businesses and developers around the world are leveraging the XRP Ledger and its native digital asset, XRP—a faster, cheaper and greener currency.
hi: सीमा पार से भुगतान से लेकर विकेंद्रीकृत वित्त तक, दुनिया भर के व्यवसाय और डेवलपर्स एक्सआरपी लेजर और इसकी मूल डिजिटल संपत्ति, एक्सआरपी-एक तेज, सस्ती और हरित मुद्रा का लाभ उठा रहे हैं।

source: Cross-Border Payments
hi: सीमा पार से भुगतान

source: Through RippleNet, financial institutions can use XRP to bridge two currencies in 3-5 seconds, ensuring payments are quickly sent and received in the local currency on either side of a transaction.
hi: RippleNet के माध्यम से, वित्तीय संस्थान 3-5 सेकंड में दो मुद्राओं को पाटने के लिए XRP का उपयोग कर सकते हैं, यह सुनिश्चित करते हुए कि लेनदेन के दोनों ओर स्थानीय मुद्रा में भुगतान जल्दी से भेजा और प्राप्त किया जाता है।

source: Learn About On-Demand Liquidity
hi: ऑन-डिमांड लिक्विडिटी के बारे में जानें

source: Businesses are leveraging XRP and the XRP Ledger to build innovative products for gaming, content and web monetization, among other applications where money is at the center.
hi: गेमिंग, सामग्री और वेब मुद्रीकरण के लिए अभिनव उत्पादों के निर्माण के लिए व्यवसाय एक्सआरपी और एक्सआरपी लेजर का लाभ उठा रहे हैं, अन्य अनुप्रयोगों के बीच जहां पैसा केंद्र में है।

source: Learn About XRP Ledger Businesses
hi: एक्सआरपी लेजर व्यवसायों के बारे में जानें

source: Digital Cryptocurrency
hi: डिजिटल क्रिप्टोक्यूरेंसी

source: Digital Cryptocurrency Wallets
hi: डिजिटल क्रिप्टोक्यूरेंसी वॉलेट

source: Individuals can use mobile wallets to store private and public passwords and interact with various blockchains to send and receive digital assets, including XRP.
hi: व्यक्ति निजी और सार्वजनिक पासवर्ड स्टोर करने के लिए मोबाइल वॉलेट का उपयोग कर सकते हैं और एक्सआरपी सहित डिजिटल संपत्ति भेजने और प्राप्त करने के लिए विभिन्न ब्लॉकचेन के साथ बातचीत कर सकते हैं।

source: Explore Wallets
hi: वॉलेट का अन्वेषण करें

source: Exchanges
hi: एक्सचेंजों

source: Market makers and individuals use exchanges to trade XRP and other digital assets. Exchanges are often also intermediaries in cross-border payments among financial institutions.
hi: बाजार निर्माता और व्यक्ति एक्सआरपी और अन्य डिजिटल संपत्तियों का व्यापार करने के लिए एक्सचेंजों का उपयोग करते हैं। एक्सचेंज अक्सर वित्तीय संस्थानों के बीच सीमा पार भुगतान में मध्यस्थ भी होते हैं।

source: Explore Exchanges
hi: एक्सचेंजों का अन्वेषण करें

source: Institutional Trading
hi: संस्थागत व्यापार

source: Market participants use XRP as a high-speed, cost-efficient and reliable trading collateral. This means seizing arbitrage opportunities, servicing margin calls and managing general trade inventory in real time.
hi: बाजार सहभागी एक्सआरपी का उपयोग उच्च गति, लागत प्रभावी और विश्वसनीय व्यापारिक संपार्श्विक के रूप में करते हैं। इसका मतलब है कि आर्बिट्राज के अवसरों को जब्त करना, मार्जिन कॉल की सेवा करना और वास्तविक समय में सामान्य व्यापार सूची का प्रबंधन करना।

source: Open Search
hi: ओपन सर्च

source: Search site...
hi: अनुसंधान क्षेत्र...

source: Close Search
hi: खोज बंद करें

source: Get Started
hi: शुरू हो जाओ

source: Status
hi: स्थिति

source: XRP Testnet:
hi: एक्सआरपी टेस्टनेट:

source: Not Connected
hi: जुड़े नहीं हैं

source: Sending Address:
hi: भेजने का पता:

source: (None)
hi: (कोई नहीं)

source: Testnet XRP Available:
hi: टेस्टनेट एक्सआरपी उपलब्ध:

source: Transaction History
hi: लेनदेन इतिहास

source: Transaction Sender
hi: लेन-देन प्रेषक

source: This tool sends transactions to the <a href="xrp-test-net-faucet.html">XRP Testnet</a> address of your choice so you can test how you monitor and respond to incoming transactions.
hi: यह टूल लेन-देन को आपकी पसंद के <a href=xrp-test-net-faucet.html>XRP टेस्टनेट</a> पते पर भेजता है ताकि आप परीक्षण कर सकें कि आप आने वाले लेन-देन की निगरानी और प्रतिक्रिया कैसे करते हैं।

source: Initialize
hi: प्रारंभ

source: Set up the necessary Testnet XRP addresses to send test payments.
hi: परीक्षण भुगतान भेजने के लिए आवश्यक टेस्टनेट एक्सआरपी पते सेट करें।

source: Destination Address
hi: गंतव्य पता

source: Send transactions to this XRP Testnet address
hi: इस एक्सआरपी टेस्टनेट पते पर लेनदेन भेजें

source: <strong>Caution:</strong> This X-address is intended for use on Mainnet. Testnet addresses have a "T" prefix instead.
hi: <strong>सावधानी:</strong> यह X-पता मेननेट पर उपयोग के लिए है। इसके बजाय टेस्टनेट पतों में T उपसर्ग होता है।

source: Send Transaction
hi: लेनदेन भेजें

source: (loading)
hi: (लोड हो रहा है)

source: Send XRP Payment
hi: एक्सआरपी भुगतान भेजें

source: drops of XRP
hi: एक्सआरपी की बूँदें

source: Send a <a href="send-xrp.html">simple XRP-to-XRP payment</a>.
hi: एक <a href=send-xrp.html>साधारण XRP-to-XRP भुगतान</a> भेजें।

source: (Getting ready to send partial payments)
hi: (आंशिक भुगतान भेजने की तैयारी)

source: Send Partial Payment
hi: आंशिक भुगतान भेजें

source: Deliver a small amount of XRP with a large <code>Amount</code> value, to test your handling of <a href="partial-payments.html">partial payments</a>.
hi: <a href=partial-payments.html>आंशिक भुगतान</a> के अपने प्रबंधन का परीक्षण करने के लिए, एक बड़े <code>राशि</code> मान के साथ XRP की एक छोटी राशि वितरित करें।

source: Create Escrow
hi: एस्क्रो बनाएं

source: seconds
hi: सेकंड

source: Finish automatically
hi: स्वचालित रूप से समाप्त करें

source: Create a <a href="escrow.html">time-based escrow</a> of 1 XRP for the specified number of seconds.
hi: निर्दिष्ट सेकंड के लिए 1 XRP का <a href=escrow.html>समय-आधारित एस्क्रो</a> बनाएं।

source: (Waiting to release Escrow when it's ready)
hi: (एस्क्रो के तैयार होने की प्रतीक्षा में)

source: Create Payment Channel
hi: भुगतान चैनल बनाएं

source: Create a <a href="payment-channels.html">payment channel</a> and fund it with the specified amount of XRP.
hi: एक <a href=payment-channels.html>भुगतान चैनल</a> बनाएं और एक्सआरपी की निर्दिष्ट राशि से इसे निधि दें।

source: Send Issued Currency
hi: जारी मुद्रा भेजें

source: Your destination address needs a <a href="trust-lines-and-issuing.html">trust line</a> to <span class="sending-address-item">(the test sender)</span> for the currency in question. Otherwise, you'll get tecPATH_DRY.
hi: आपके गंतव्य पते के लिए <a href= rust-lines-and-issuing.html>ट्रस्ट लाइन</a> से <span class=sending-address-item>(परीक्षा प्रेषक)</span> की आवश्यकता है प्रश्न में मुद्रा। अन्यथा, आपको tecPATH_DRY मिलेगा।

source: Trust for
hi: के लिए भरोसा करें

source: The test sender creates a <a href="trust-lines-and-issuing.html">trust line</a> to your account for the given currency.
hi: परीक्षण प्रेषक दी गई मुद्रा के लिए आपके खाते में एक <a href= rust-lines-and-issuing.html>ट्रस्ट लाइन</a> बनाता है।

source: Domain Verification Checker
hi: डोमेन सत्यापन परीक्षक

source: This tool allows you to verify that <a href="xrp-ledger-toml.html#domain-verification">domain verification</a> is properly configured.
hi: यह टूल आपको यह सत्यापित करने की अनुमति देता है कि <a href=xrp-ledger-toml.html#domain-verification>डोमेन सत्यापन</a> ठीक से कॉन्फ़िगर किया गया है।

source: Enter the manifest found in your validator-keys.json file. Do not confuse this with your validator's secret key.
hi: अपनी सत्यापनकर्ता-keys.json फ़ाइल में पाया गया मेनिफेस्ट दर्ज करें। इसे अपने सत्यापनकर्ता की गुप्त कुंजी के साथ भ्रमित न करें।

source: To do this with the validator-keys-tool use the following command:
hi: सत्यापनकर्ता-कुंजी-उपकरण के साथ ऐसा करने के लिए निम्न आदेश का उपयोग करें:

source: Your Manifest Here
hi: आपका प्रकट यहाँ

source: Result
hi: नतीजा

source: Try an account like <em>rf1BiGeXwwQoi8Z2ueFYTEXSwuJYfV2Jpn</em>.
hi: <em>rf1BiGeXwwQoi8Z2ueFYTEXSwuJYfV2Jpn</em> जैसा खाता आज़माएं.

source: Get info
hi: जानकारी मिलना

source: Permalink
hi: स्थायी लिंक

source: Explorer
hi: एक्सप्लोरर

source: expand all
hi: सभी का विस्तार करें

source: collapse all
hi: सभी को संकुचित करें

source: expand tx
hi: tx . का विस्तार करें

source: next 20
hi: अगले 20

source: prev 20
hi: पिछला 20
