Repository: 0xhotchocolate/xrpl-dev-portal
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: hi

source: Sustainability
hi: स्थिरता

source: Sustainability icon
hi: स्थिरता आइकन

source: How Green Is Your Currency?
hi: आपकी मुद्रा कितनी हरित है?

source: Explore the Interactive Tool
hi: इंटरएक्टिव टूल का अन्वेषण करें

source: Energy Consumption for Cash, Credit Cards and Crypto
hi: नकद, क्रेडिट कार्ड और क्रिप्टो के लिए ऊर्जा की खपत

source: Moving money carries cost—and not just the fee on your transaction or the value of your payment.
hi: पैसे ले जाने में लागत होती है- न कि केवल आपके लेन-देन पर शुल्क या आपके भुगतान का मूल्य।

source: Whether it’s in cash, on a credit card or with crypto, every transaction you make consumes energy, and therefore, emits pollutants into the environment.
hi: चाहे वह नकद में हो, क्रेडिट कार्ड पर या क्रिप्टो के साथ, आपके द्वारा किया गया प्रत्येक लेनदेन ऊर्जा की खपत करता है, और इसलिए, पर्यावरण में प्रदूषकों का उत्सर्जन करता है।

source: The impact of this is startling when you look at the total transactions across an entire year—for any one form of currency.
hi: इसका प्रभाव चौंका देने वाला होता है जब आप एक पूरे वर्ष के कुल लेन-देन को देखते हैं—मुद्रा के किसी एक रूप के लिए।

source: Find out more about the environmental cost of some of the world’s most popular and innovative currencies, and start making more educated choices about how you transact.
hi: दुनिया की कुछ सबसे लोकप्रिय और नवोन्मेषी मुद्राओं की पर्यावरणीय लागत के बारे में और जानें, और आप कैसे लेन-देन करते हैं, इसके बारे में अधिक शिक्षित विकल्प बनाना शुरू करें।

source: How Does XRP Compare to Other Currencies?
hi: एक्सआरपी अन्य मुद्राओं की तुलना कैसे करता है?

source: Learn more about the methodology
hi: कार्यप्रणाली के बारे में अधिक जानें

source: Change Inputs
hi: इनपुट बदलें

source: Comparing<br/> Transaction Data
hi: तुलना<br/> लेन-देन डेटा

source: Crypto
hi: क्रिप्टो

source: Credit Cards
hi: क्रेडिट कार्ड

source: Cash
hi: नकद

source: Twitter share
hi: ट्विटर शेयर

source: LinkedIn share
hi: लिंक्डइन शेयर

source: Facebook share
hi: फेसबुक शेयर

source: Energy Consumption of Portugal
hi: पुर्तगाल की ऊर्जा खपत

source: Comparing <span class="slider-amt"></span> Million Transactions in 2019
hi: तुलना <span class=slider-amt></span> 2019 में मिलियन लेनदेन

source: The country of Portugal consumes 46.94 billion Kilowatt hours (kWh) of energy annually. Explore how much energy today’s various currencies consume in relation to Portugal.
hi: पुर्तगाल देश सालाना 46.94 बिलियन किलोवाट घंटे (kWh) ऊर्जा की खपत करता है। अन्वेषण करें कि पुर्तगाल के संबंध में आज की विभिन्न मुद्राएं कितनी ऊर्जा की खपत करती हैं।

source: Portugal
hi: पुर्तगाल

source: Bitcoin
hi: बिटकॉइन

source: kWh
hi: किलोवाट

source: Ethereum
hi: एथेरियम

source: Visa
hi: वीसा

source: Mastercard
hi: मास्टर कार्ड

source: CO<sub>2</sub> Emissions from Airline Flights
hi: CO<sub>2</sub> एयरलाइन उड़ानों से उत्सर्जन

source: A 12-hour flight from London to Hong Kong releases 3 tons of carbon dioxide (CO<sub>2</sub>). Discover how much CO<sub>2</sub> different forms of currency release in comparison to emissions from airline flights.
hi: लंदन से हांगकांग के लिए 12 घंटे की उड़ान से 3 टन कार्बन डाइऑक्साइड (CO<sub>2</sub>) निकलती है। पता लगाएं कि एयरलाइन उड़ानों से उत्सर्जन की तुलना में कितनी CO<sub>2</sub> मुद्रा जारी करने के विभिन्न रूप हैं।

source: metric tons of CO<sub>2</sub>
hi: मीट्रिक टन CO<sub>2</sub>

source: Gas Consumption by the Gallon
hi: गैलन द्वारा गैस की खपत

source: An Ultra Large Crude Carrier (ULCC) carries approximately 120 million gallons of gas. Measure the environmental impact between currencies in relation to the amount of gas they would consume in the real-world.
hi: एक अल्ट्रा लार्ज क्रूड कैरियर (ULCC) लगभग 120 मिलियन गैलन गैस वहन करता है। वास्तविक दुनिया में उनके द्वारा उपभोग की जाने वाली गैस की मात्रा के संबंध में मुद्राओं के बीच पर्यावरणीय प्रभाव को मापें।

source: Gallons of Gas
hi: गैस के गैलन

source: Breaking Down Individual Transactions
hi: व्यक्तिगत लेनदेन को तोड़ना

source: Looking at individual transactions below, compare how a single transaction across each form of currency equates to kWh, CO<sub>2</sub> emissions, and gallons of gas.
hi: नीचे दिए गए व्यक्तिगत लेन-देन को देखते हुए, तुलना करें कि मुद्रा के प्रत्येक रूप में एक एकल लेनदेन kWh, CO<sub>2</sub> उत्सर्जन और गैलन गैस के बराबर कैसे होता है।

source: Kilowatt Hour
hi: किलोवाट घंटा

source: CO<sub>2</sub> Emissions*
hi: CO<sub>2</sub> उत्सर्जन*

source: Paper Currency
hi: कागज़ी मुद्रा

source: *Calculations in million tonne (Mt)
hi: *गणना मिलियन टन (माउंट) में

source: For Developers
hi: डेवलपर्स के लिए

source: Thank you for your interest in contributing to XRPL.org. This website was created for the community and is meant to be a living, breathing source of truth for XRP and XRP Ledger resources.
hi: XRPL.org में योगदान करने में आपकी रुचि के लिए धन्यवाद। यह वेबसाइट समुदाय के लिए बनाई गई थी और यह XRP और XRP लेजर संसाधनों के लिए सत्य का एक जीवित, सांस लेने वाला स्रोत है।

source: Contributing to XRPL.org is a great way to learn about the XRP Ledger. This portal is open-source and anyone can suggest changes. For more information, please <a href="https://github.com/ripple/xrpl-dev-portal/blob/master/CONTRIBUTING.md" target="_blank">read and consider the contributing guidelines</a>.
hi: XRPL.org में योगदान करना XRP लेजर के बारे में जानने का एक शानदार तरीका है। यह पोर्टल ओपन-सोर्स है और कोई भी बदलाव का सुझाव दे सकता है। अधिक जानकारी के लिए, कृपया <a href=https://github.com/ripple/xrpl-dev-portal/blob/master/CONTRIBUTING.md target=_blank>योगदान दिशानिर्देशों को पढ़ें और उन पर विचार करें</a> .

source: You may also be interested in learning about <a href="https://interledger.org/" target="_blank">Interledger</a>, <a href="https://ripplex.io/" target="_blank">RippleX</a>, and <a href="https://paystring.org/" target="_blank">PayString</a>.
hi: आपको <a href=https://interledger.org/ target=_blank>Interledger</a>, <a href=https://ripplex.io/ target= के बारे में जानने में भी रुचि हो सकती है। _blank>RippleX</a>, और <a href=https://paystring.org/ target=_blank>PayString</a>।

source: Sorry, this page is not available in your language.
hi: क्षमा करें, यह पृष्ठ आपकी भाषा में उपलब्ध नहीं है।

source: We are making an effort to offer the XRP Ledger Dev Portal in a variety of languages, but not all pages are available in all languages. If you'd like to help, <a href="https://github.com/ripple/xrpl-dev-portal/blob/master/CONTRIBUTING.md">please contribute!</a>
hi: हम एक्सआरपी लेजर देव पोर्टल को विभिन्न भाषाओं में पेश करने का प्रयास कर रहे हैं, लेकिन सभी पेज सभी भाषाओं में उपलब्ध नहीं हैं। अगर आप मदद करना चाहते हैं, तो <a href=https://github.com/ripple/xrpl-dev-portal/blob/master/CONTRIBUTING.md>कृपया योगदान दें!</a>

source: In this document
hi: इस दस्तावेज़ में

source: Solving Real Problems Across Industries
hi: उद्योगों में वास्तविक समस्याओं का समाधान

source: Businesses Running on the XRP Ledger
hi: एक्सआरपी लेजर पर चलने वाले व्यवसाय

source: While exchanges and wallet providers are the most common businesses running on the XRP Ledger, there are many other companies that leverage the technology to solve interesting problems across myriad industries.
hi: जबकि एक्सचेंज और वॉलेट प्रदाता एक्सआरपी लेजर पर चलने वाले सबसे आम व्यवसाय हैं, कई अन्य कंपनियां हैं जो असंख्य उद्योगों में दिलचस्प समस्याओं को हल करने के लिए प्रौद्योगिकी का लाभ उठाती हैं।

source: Asset Custody
hi: एसेट कस्टडी

source: Payment Processing
hi: भुगतान प्रक्रिया

source: Micropayments
hi: सूक्ष्म भुगतान

source: Wallets
hi: पर्स

source: Music
hi: संगीत

source: On-Demand Liquidity
hi: मांग पर चलनिधि

source: Gaming
hi: खेल

source: Infrastructure
hi: आधारभूत संरचना

source: Security
hi: सुरक्षा

source: Applications
hi: अनुप्रयोग

source: Businesses Using XRP
hi: एक्सआरपी का उपयोग करने वाले व्यवसाय

source: BitGo provides custodial and non-custodial asset holdings for digital assets including XRP. BitGo's enterprise-level security empowers businesses to integrate digital currencies like XRP into new and existing financial systems.
hi: BitGo, XRP सहित डिजिटल परिसंपत्तियों के लिए कस्टोडियल और गैर-कस्टोडियल एसेट होल्डिंग्स प्रदान करता है। BitGo की उद्यम-स्तरीय सुरक्षा व्यवसायों को XRP जैसी डिजिटल मुद्राओं को नई और मौजूदा वित्तीय प्रणालियों में एकीकृत करने का अधिकार देती है।

source: BitPay builds powerful, enterprise-grade tools for accepting and spending cryptocurrencies, including XRP.
hi: बिटपे एक्सआरपी सहित क्रिप्टोकरेंसी को स्वीकार करने और खर्च करने के लिए शक्तिशाली, एंटरप्राइज-ग्रेड टूल बनाता है।

source: Web Monetization
hi: वेब मुद्रीकरण

source: Coil provides an alternative to the status quo of paid advertisements with web monetization. Coil's web monetization uses the interledger protocol (ILP) to stream micropayments as users consume content. The XRP Ledger's payment channels provide an ideal system for settling these micropayments at high speed and low cost.
hi: कॉइल वेब मुद्रीकरण के साथ भुगतान किए गए विज्ञापनों की यथास्थिति का एक विकल्प प्रदान करता है। जब उपयोगकर्ता सामग्री का उपभोग करते हैं तो कॉइल का वेब मुद्रीकरण माइक्रोपेमेंट को स्ट्रीम करने के लिए इंटरलेजर प्रोटोकॉल (ILP) का उपयोग करता है। एक्सआरपी लेजर के भुगतान चैनल इन सूक्ष्म भुगतानों को उच्च गति और कम लागत पर निपटाने के लिए एक आदर्श प्रणाली प्रदान करते हैं।

source: Online Gaming
hi: ऑनलाइन गेमिंग

source: Forte offers an unprecedented set of easy-to-use tools and services for game developers to integrate blockchain technology into their games, to unlock new economic and creative opportunities for gamers across the world.
hi: Forte गेम डेवलपर्स के लिए उपयोग में आसान टूल और सेवाओं का एक अभूतपूर्व सेट प्रदान करता है ताकि दुनिया भर के गेमर्स के लिए नए आर्थिक और रचनात्मक अवसरों को अनलॉक करने के लिए अपने गेम में ब्लॉकचेन तकनीक को एकीकृत किया जा सके।

source: Wallet and Platform
hi: वॉलेट और प्लेटफॉर्म

source: GateHub is a platform for the Internet of Value, built on XRP Ledger protocol. It allows everyone to send, receive, trade and manage any type of assets.
hi: गेटहब इंटरनेट ऑफ वैल्यू के लिए एक प्लेटफॉर्म है, जिसे एक्सआरपी लेजर प्रोटोकॉल पर बनाया गया है। यह सभी को किसी भी प्रकार की संपत्ति भेजने, प्राप्त करने, व्यापार करने और प्रबंधित करने की अनुमति देता है।

source: Wallets and Apps
hi: वॉलेट और ऐप्स

source: Exodus offers wallets and applications for securing, managing and exchanging crypto.
hi: एक्सोडस क्रिप्टो को सुरक्षित करने, प्रबंधित करने और एक्सचेंज करने के लिए वॉलेट और एप्लिकेशन प्रदान करता है।

source: Raised in Space is a music/tech investment group focused on raising the value of music, innovating across the entire value chain of the music industry.
hi: राइज़्ड इन स्पेस एक संगीत/तकनीक निवेश समूह है जो संगीत उद्योग की संपूर्ण मूल्य श्रृंखला में नवाचार करते हुए संगीत के मूल्य को बढ़ाने पर केंद्रित है।

source: Ripple powers instant, lower-cost settlement of cross-border payments using XRP to source liquidity on demand. XRP is ideally suited for global payments because it's quicker, less costly, and more scalable than any other digital asset.
hi: रिपल ने मांग पर तरलता के स्रोत के लिए एक्सआरपी का उपयोग करके सीमा पार से भुगतान के तत्काल, कम लागत वाले निपटान की शक्ति प्रदान की। एक्सआरपी वैश्विक भुगतान के लिए आदर्श रूप से अनुकूल है क्योंकि यह किसी भी अन्य डिजिटल संपत्ति की तुलना में तेज, कम खर्चीला और अधिक स्केलेबल है।

source: Towo Labs was founded in 2019, to develop XRP Ledger and Interledger infrastructures and make non-custodial crypto management easier.
hi: टोवो लैब्स की स्थापना 2019 में एक्सआरपी लेजर और इंटरलेजर इन्फ्रास्ट्रक्चर को विकसित करने और गैर-कस्टोडियल क्रिप्टो प्रबंधन को आसान बनाने के लिए की गई थी।

source: Xrplorer offers services and tools that help prevent and combat fraudulent activity on the XRP Ledger as well as custom APIs and analytics that supplement the XRP Ledger APIs where they are not enough.
hi: Xrplorer सेवाएं और उपकरण प्रदान करता है जो XRP लेजर के साथ-साथ कस्टम API और एनालिटिक्स पर धोखाधड़ी गतिविधि को रोकने और मुकाबला करने में मदद करता है जो XRP लेजर एपीआई के पूरक हैं जहां वे पर्याप्त नहीं हैं।

source: From cold storage to apps for signing transactions, XRPL Labs is dedicated to building software on the XRP Ledger.
hi: लेनदेन पर हस्ताक्षर करने के लिए कोल्ड स्टोरेज से लेकर ऐप्स तक, एक्सआरपीएल लैब्स एक्सआरपी लेजर पर सॉफ्टवेयर बनाने के लिए समर्पित है।

source: Disclaimer: XRPL.org does not endorse or recommend any wallets or exchanges, or make any representations with respect to wallets. It’s advisable to conduct your own due diligence before relying on any third party or third-party technology.
hi: अस्वीकरण: XRPL.org किसी भी वॉलेट या एक्सचेंज का समर्थन या अनुशंसा नहीं करता है, या वॉलेट के संबंध में कोई प्रतिनिधित्व नहीं करता है। यह सलाह दी जाती है कि किसी भी तृतीय पक्ष या तृतीय-पक्ष तकनीक पर भरोसा करने से पहले अपना स्वयं का उचित परिश्रम करें।

source: XRP Is Traded on More Than 100 Markets and Exchanges Worldwide
hi: XRP का दुनिया भर में 100 से अधिक बाजारों और एक्सचेंजों पर कारोबार होता है

source: XRP Exchanges
hi: एक्सआरपी एक्सचेंज

source: Exchanges are where people trade currencies.
hi: एक्सचेंज वे हैं जहां लोग मुद्राओं का व्यापार करते हैं।

source: There are different types of exchanges that vary depending on the type of market (spot, futures, options, swaps), and the type of security model (custodial, non-custodial).
hi: विभिन्न प्रकार के एक्सचेंज हैं जो बाजार के प्रकार (स्पॉट, फ्यूचर्स, ऑप्शंस, स्वैप्स) और सुरक्षा मॉडल के प्रकार (कस्टोडियल, नॉन-कस्टोडियल) के आधार पर भिन्न होते हैं।

source: Spot exchanges allow people to buy and sell cryptocurrencies at current (spot) market rates. Futures, options and swap exchanges allow people to buy and sell standardized contracts of cryptocurrency market rates in the future.
hi: स्पॉट एक्सचेंज लोगों को वर्तमान (स्पॉट) बाजार दरों पर क्रिप्टोकरेंसी खरीदने और बेचने की अनुमति देते हैं। फ्यूचर्स, ऑप्शंस और स्वैप एक्सचेंज लोगों को भविष्य में क्रिप्टोक्यूरेंसी बाजार दरों के मानकीकृत अनुबंधों को खरीदने और बेचने की अनुमति देते हैं।

source: Custodial exchanges manage a user’s private keys, and publish centralized order books of buyers and sellers. Non-custodial exchanges, also known as decentralized exchanges, do not manage a user’s private keys, and publish decentralized order books of buyers and sellers on a blockchain.
hi: कस्टोडियल एक्सचेंज उपयोगकर्ता की निजी कुंजी का प्रबंधन करते हैं, और खरीदारों और विक्रेताओं की केंद्रीकृत ऑर्डर बुक प्रकाशित करते हैं। गैर-कस्टोडियल एक्सचेंज, जिसे विकेंद्रीकृत एक्सचेंज के रूप में भी जाना जाता है, उपयोगकर्ता की निजी कुंजी का प्रबंधन नहीं करता है, और एक ब्लॉकचेन पर खरीदारों और विक्रेताओं की विकेन्द्रीकृत ऑर्डर बुक प्रकाशित करता है।

source: Top Exchanges, according to CryptoCompare (as of August 2020):
hi: क्रिप्टोकरंसी के अनुसार शीर्ष एक्सचेंज (अगस्त 2020 तक):

source: Disclaimer: This information is drawn from other sources on the internet. XRPL.org does not endorse or recommend any exchanges or make any representations with respect to exchanges or the purchase or sale of digital assets more generally. It’s advisable to conduct your own due diligence before relying on any third party or third-party technology, and providers may vary significantly in their compliance, data security, and privacy practices.
hi: अस्वीकरण: यह जानकारी इंटरनेट पर अन्य स्रोतों से ली गई है। XRPL.org आम तौर पर एक्सचेंजों या डिजिटल संपत्तियों की खरीद या बिक्री के संबंध में किसी भी एक्सचेंज का समर्थन या अनुशंसा नहीं करता है या कोई प्रतिनिधित्व नहीं करता है। किसी भी तीसरे पक्ष या तीसरे पक्ष की तकनीक पर भरोसा करने से पहले अपने स्वयं के उचित परिश्रम का संचालन करने की सलाह दी जाती है, और प्रदाता उनके अनुपालन, डेटा सुरक्षा और गोपनीयता प्रथाओं में महत्वपूर्ण रूप से भिन्न हो सकते हैं।

source: Options for Storing XRP
hi: एक्सआरपी स्टोर करने के विकल्प

source: XRP Wallets
hi: एक्सआरपी वॉलेट

source: Digital wallets are pieces of software that allow people to send, receive and store cryptocurrencies, including XRP. There are two types of digital wallets: custodial and non-custodial.
hi: डिजिटल वॉलेट सॉफ्टवेयर के टुकड़े हैं जो लोगों को XRP सहित क्रिप्टोकरेंसी भेजने, प्राप्त करने और संग्रहीत करने की अनुमति देते हैं। डिजिटल वॉलेट दो प्रकार के होते हैं: कस्टोडियल और नॉन-कस्टोडियल।

source: Custodial wallets manage a user's private key, which allows the wallet to withdraw cryptocurrency on a user's behalf. Non-custodial wallets do not manage a user's private key, which is up to the user to manage, and therefore cannot send cryptocurrency on the user's behalf.
hi: कस्टोडियल वॉलेट उपयोगकर्ता की निजी कुंजी का प्रबंधन करते हैं, जो वॉलेट को उपयोगकर्ता की ओर से क्रिप्टोकरेंसी को वापस लेने की अनुमति देता है। गैर-कस्टोडियल वॉलेट उपयोगकर्ता की निजी कुंजी का प्रबंधन नहीं करते हैं, जो उपयोगकर्ता को प्रबंधित करने के लिए है, और इसलिए उपयोगकर्ता की ओर से क्रिप्टोकुरेंसी नहीं भेज सकता है।

source: XRP Ledger Software Wallets:
hi: एक्सआरपी लेजर सॉफ्टवेयर वॉलेट:

source: Hardware Wallets:
hi: हार्डवेयर वॉलेट:

source: Disclaimer: XRPL.org does not endorse or recommend any wallets or make any representations with respect to wallets or the purchase or sale of digital assets more generally. It’s advisable to conduct your own due diligence before relying on any third party or third-party technology, and providers may vary significantly in their compliance, data security, and privacy practices.
hi: अस्वीकरण: XRPL.org किसी भी वॉलेट का समर्थन या अनुशंसा नहीं करता है या आमतौर पर वॉलेट या डिजिटल संपत्ति की खरीद या बिक्री के संबंध में कोई प्रतिनिधित्व नहीं करता है। किसी भी तीसरे पक्ष या तीसरे पक्ष की तकनीक पर भरोसा करने से पहले अपने स्वयं के उचित परिश्रम का संचालन करने की सलाह दी जाती है, और प्रदाता उनके अनुपालन, डेटा सुरक्षा और गोपनीयता प्रथाओं में महत्वपूर्ण रूप से भिन्न हो सकते हैं।

source: License
hi: लाइसेंस

source: Jump to top of page
hi: पृष्ठ के शीर्ष पर जाएं

source: Top
hi: शीर्ष

source: Edit
hi: संपादित करें

source: Scroll Down
hi: नीचे स्क्रॉल करें

source: XRP: The Best Digital Asset for Payments
hi: एक्सआरपी: भुगतान के लिए सर्वश्रेष्ठ डिजिटल संपत्ति

source: Learn More
hi: और अधिक जानें

source: Build with the XRP Ledger
hi: एक्सआरपी लेजर के साथ निर्माण

source: XRP Ledger
hi: एक्सआरपी लेजर

source: What is XRPL.org?
hi: XRPL.org क्या है?

source: A Community-Driven Resource for All Things XRP and XRP Ledger
hi: सभी चीजों के लिए एक समुदाय-संचालित संसाधन एक्सआरपी और एक्सआरपी लेजर

source: Whether you’re a developer building on the XRP Ledger (XRPL) or just getting acquainted with blockchain and digital assets, XRPL.org is your source for technical information, reference materials, tools and all things XRP.
hi: चाहे आप एक्सआरपी लेजर (एक्सआरपीएल) पर एक डेवलपर बिल्डिंग हों या सिर्फ ब्लॉकचैन और डिजिटल संपत्तियों से परिचित हों, एक्सआरपीएल.org तकनीकी जानकारी, संदर्भ सामग्री, टूल और सभी चीजों के लिए एक्सआरपी का स्रोत है।

source: Fast
hi: तेज़

source: Scalable
hi: मापनीय

source: Low-Cost
hi: कम लागत

source: Sustainable
hi: टिकाऊ

source: What is XRP?
hi: एक्सआरपी क्या है?

source: A Digital Asset Built for Payments
hi: भुगतान के लिए निर्मित एक डिजिटल संपत्ति

source: XRP is a digital asset built for payments. It is the native digital asset on the XRP Ledger—an open-source, permissionless and decentralized blockchain technology that can settle transactions in 3-5 seconds.
hi: XRP भुगतान के लिए बनाई गई एक डिजिटल संपत्ति है। यह एक्सआरपी लेजर पर मूल डिजिटल संपत्ति है - एक खुला स्रोत, अनुमति रहित और विकेन्द्रीकृत ब्लॉकचेन तकनीक जो 3-5 सेकंड में लेनदेन का निपटान कर सकती है।

source: It is the best way to move money around the world; the fuel for our growing digital economy.
hi: यह दुनिया भर में पैसा स्थानांतरित करने का सबसे अच्छा तरीका है; हमारी बढ़ती डिजिटल अर्थव्यवस्था के लिए ईंधन।

source: Learn about XRP
hi: एक्सआरपी के बारे में जानें

source: XRP History
hi: एक्सआरपी इतिहास

source: Use Cases
hi: बक्सों का इस्तेमाल करें

source: XRP in the Real World
hi: वास्तविक दुनिया में एक्सआरपी

source: Uses of XRP
hi: एक्सआरपी के उपयोग

source: XRP is helping solve previously unsolvable problems for people and industries around the world, and is one of the only digital assets with a commercial use case.
hi: एक्सआरपी दुनिया भर के लोगों और उद्योगों के लिए पहले से न सुलझाई जा सकने वाली समस्याओं को हल करने में मदद कर रहा है, और व्यावसायिक उपयोग के मामले में एकमात्र डिजिटल संपत्ति में से एक है।

source: Explore Uses
hi: उपयोग का अन्वेषण करें

source: Businesses on the Ledger
hi: खाता बही पर व्यवसाय

source: From gaming to web monetization, XRP and the XRP Ledger are powering innovative new technology across the payments space.
hi: गेमिंग से लेकर वेब मुद्रीकरण तक, एक्सआरपी और एक्सआरपी लेजर भुगतान क्षेत्र में नवीन नई तकनीक को सशक्त कर रहे हैं।

source: Explore Businesses
hi: व्यवसायों का अन्वेषण करें

source: Real-World Impact
hi: वास्तविक-विश्व प्रभाव

source: With its real-world utility and inherently green design, XRP helps ensure a more sustainable future for our planet and global economy.
hi: अपनी वास्तविक दुनिया की उपयोगिता और स्वाभाविक रूप से हरे रंग के डिजाइन के साथ, एक्सआरपी हमारे ग्रह और वैश्विक अर्थव्यवस्था के लिए एक अधिक टिकाऊ भविष्य सुनिश्चित करने में मदद करता है।

source: Explore Impact
hi: प्रभाव का अन्वेषण करें

source: Green by Nature
hi: प्रकृति द्वारा हरा

source: XRP was designed with sustainability in mind. Contrary to other blockchains that use proof-of-work, the XRP Ledger confirms transactions through a unique “<a href="intro-to-consensus.html">consensus</a>” mechanism and is one of the first truly <a href="https://ripple.com/ripple-press/ripple-leads-sustainability-agenda-to-achieve-carbon-neutrality-by-2030/" target="_blank">carbon neutral blockchains</a>.
hi: XRP को स्थिरता को ध्यान में रखकर बनाया गया था। काम के सबूत का उपयोग करने वाले अन्य ब्लॉकचेन के विपरीत, एक्सआरपी लेजर एक अद्वितीय "<a href=intro-to-consensus.html>Consensus</a>" तंत्र के माध्यम से लेनदेन की पुष्टि करता है और यह वास्तव में पहले <a href=intro-to-consensus.html>Consensus</a> में से एक है। a href=https://ripple.com/ripple-press/ripple-leads-sustainability-agenda-to-achieve-carbon-neutrality-by-2030/ target=_blank>कार्बन न्यूट्रल ब्लॉकचेन</a> .

source: Explore the energy consumption of XRP compared to cash, credit cards and other popular crypto with the <a href="carbon-calculator.html">Green Currency Calculator</a>.
hi: <a href=carbon-calculator.html>ग्रीन करेंसी कैलकुलेटर</a> के साथ नकद, क्रेडिट कार्ड और अन्य लोकप्रिय क्रिप्टो की तुलना में XRP की ऊर्जा खपत का अन्वेषण करें।

source: Go Green
hi: पर्यावरण के अनुकूल बनें

source: Partners in Sustainability
hi: स्थिरता में भागीदार

source: XRP Ledger Documentation
hi: एक्सआरपी लेजर दस्तावेज़ीकरण

source: Dive into our documentation and start integrating with the XRP Ledger.
hi: हमारे दस्तावेज़ीकरण में गोता लगाएँ और XRP लेजर के साथ एकीकरण शुरू करें।

source: Browse by category, or skip straight to the <a href="#full-doc-index">full documentation index</a>.
hi: श्रेणी के अनुसार ब्राउज़ करें, या सीधे <a href=#full-doc-index>पूर्ण दस्तावेज़ीकरण अनुक्रमणिका</a> पर जाएं।

source: View All %(parent_name)s
hi: सभी देखें %(parent_name)s

source: Full Documentation Index
hi: पूर्ण दस्तावेज़ीकरण सूचकांक

source: Or, skip ahead to the <a href="#full-reference-index">Full Reference Index</a>.
hi: या, <a href=#full-reference-index>पूर्ण संदर्भ अनुक्रमणिका</a> पर जाएं।

source: Full Reference Index
hi: पूर्ण संदर्भ सूचकांक

source: Build a Better Bitcoin
hi: एक बेहतर बिटकॉइन बनाएं

source: XRP’s Origin
hi: एक्सआरपी की उत्पत्ति

source: In 2011, three engineers—David Schwartz, Jed McCaleb and Arthur Britto—began developing the XRP Ledger.
hi: 2011 में, तीन इंजीनियरों- डेविड श्वार्ट्ज, जेड मैककलेब और आर्थर ब्रिटो- ने एक्सआरपी लेजर विकसित करना शुरू किया।

source: Fascinated by Bitcoin, they set out to create a better version that improved upon its limitations—with the goal of creating a digital asset that was more sustainable and built specifically for payments.
hi: बिटकॉइन से मोहित होकर, उन्होंने एक बेहतर संस्करण बनाने के लिए निर्धारित किया जो इसकी सीमाओं में सुधार करता है-एक डिजिटल संपत्ति बनाने के लक्ष्य के साथ जो अधिक टिकाऊ और विशेष रूप से भुगतान के लिए बनाया गया था।
