Repository: 0xhotchocolate/xrpl-dev-portal
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: hi

source: The XRP Ledger first launched in June 2012. Shortly thereafter, they were joined by Chris Larsen and the group started the Company OpenCoin in September 2012 (now named Ripple).
hi: एक्सआरपी लेजर को पहली बार जून 2012 में लॉन्च किया गया था। इसके तुरंत बाद, वे क्रिस लार्सन से जुड़ गए और समूह ने सितंबर 2012 में कंपनी ओपनकॉइन शुरू किया (जिसे अब रिपल नाम दिया गया है)।

source: The founders of the XRP Ledger gifted 80 billion XRP to the company. Ripple has since sold some of its XRP and put the rest in <a href="https://ripple.com/insights/explanation-ripples-xrp-escrow/" target="_blank">escrow</a>.
hi: XRP लेजर के संस्थापकों ने कंपनी को 80 बिलियन XRP उपहार में दिए। रिपल ने तब से अपने कुछ एक्सआरपी को बेच दिया है और बाकी को <a href=https://ripple.com/insights/explanation-ripples-xrp-escrow/ target=_blank>एस्क्रो</a> में डाल दिया है।

source: Timeline of XRP Evolution
hi: एक्सआरपी विकास की समयरेखा

source: 2011 XRP Ledger Development
hi: 2011 एक्सआरपी लेजर विकास

source: The history of the XRP Ledger and its native digital asset XRP dates back to early 2011 when three developers—David Schwartz, Jed McCaleb and Arthur Britto—were fascinated with Bitcoin but observed the <a href="carbon-calculator.html">waste inherent in mining</a>. They sought to create a better system for sending value (an idea outlined in a <a href="https://bitcointalk.org/index.php?topic=10193.0" target="_blank">May 2011 forum post: “Bitcoin without mining”</a>).
hi: एक्सआरपी लेजर और इसकी मूल डिजिटल संपत्ति एक्सआरपी का इतिहास 2011 की शुरुआत में है, जब तीन डेवलपर्स-डेविड श्वार्ट्ज, जेड मैककेलेब और आर्थर ब्रिटो-बिटकॉइन से मोहित थे, लेकिन उन्होंने <a href=carbon-calculator.html>अपशिष्ट देखा खनन में निहित</a>। उन्होंने मूल्य भेजने के लिए एक बेहतर प्रणाली बनाने की मांग की (एक <a href=https://bitcointalk.org/index.php?topic=10193.0 target=_blank>मई 2011 फोरम पोस्ट में उल्लिखित एक विचार: "बिटकॉइन खनन के बिना"</a>)।

source: Their initial observations about the high energy consumption and scalability issues that would plague Bitcoin proved prescient. (In 2019, estimates suggest <a href="carbon-calculator.html">Bitcoin mining used</a> more energy than the entire country of Portugal!) Moreover, their initial read indicated that significant problems could arise if any miner obtained (or miners colluded to obtain) greater than 50&#37; of the mining power—that risk persists with Bitcoin (and Ethereum) today as mining power has consolidated in China.
hi: उच्च ऊर्जा खपत और मापनीयता के मुद्दों के बारे में उनकी प्रारंभिक टिप्पणियां जो बिटकॉइन को प्रभावित करती हैं, प्रेजेंटेटिव साबित हुईं। (2019 में, अनुमान बताते हैं कि <a href=carbon-calculator.html>बिटकॉइन माइनिंग का इस्तेमाल किया गया</a> पूरे पुर्तगाल देश की तुलना में अधिक ऊर्जा है!) इसके अलावा, उनके प्रारंभिक पढ़ने से संकेत मिलता है कि यदि कोई खनिक (या खनिक प्राप्त करने के लिए मिलीभगत) 50&#37 से अधिक; खनन शक्ति का - यह जोखिम आज भी बिटकॉइन (और एथेरियम) के साथ बना हुआ है क्योंकि खनन शक्ति चीन में समेकित हो गई है।

source: 2012 XRP Launched
hi: 2012 एक्सआरपी लॉन्च किया गया

source: In 2011 and early 2012, the trio of developers started a project to build a distributed ledger that improved upon these fundamental limitations of Bitcoin—their first ever code commit was in November 2011.
hi: 2011 और 2012 की शुरुआत में, डेवलपर्स की तिकड़ी ने एक वितरित बहीखाता बनाने के लिए एक परियोजना शुरू की, जो बिटकॉइन की इन मूलभूत सीमाओं में सुधार करती है - उनकी पहली कोड प्रतिबद्धता नवंबर 2011 में थी।

source: They wrote code, that when executed, would create a distributed ledger, which they named Ripple. It included a digital asset that would be called “ripples” (XRP as the currency code) to follow the same naming convention as Bitcoin (BTC). At the time, Ripple stood for the open-source project, the unique consensus ledger (Ripple Consensus Ledger), transaction protocol (Ripple Transaction Protocol or RTXP), the network (Ripple network) and the digital asset (known as “ripples”).
hi: उन्होंने कोड लिखा, कि निष्पादित होने पर, एक वितरित खाता बही बनाएगा, जिसे उन्होंने रिपल नाम दिया। इसमें एक डिजिटल संपत्ति शामिल थी जिसे बिटकॉइन (बीटीसी) के समान नामकरण सम्मेलन का पालन करने के लिए "रिपल्स" (मुद्रा कोड के रूप में एक्सआरपी) कहा जाएगा। उस समय, रिपल ओपन-सोर्स प्रोजेक्ट के लिए खड़ा था, अद्वितीय सर्वसम्मति बहीखाता (रिपल सर्वसम्मति लेजर), लेनदेन प्रोटोकॉल (रिपल लेनदेन प्रोटोकॉल या आरटीएक्सपी), नेटवर्क (रिपल नेटवर्क) और डिजिटल संपत्ति (जिसे "लहर" के रूप में जाना जाता है) .

source: In practice, this approach led to many, broad uses of “Ripple.” To clarify, the community simply started calling the digital asset, “XRP.”
hi: व्यवहार में, इस दृष्टिकोण ने "रिपल" के कई व्यापक उपयोगों को जन्म दिया। स्पष्ट करने के लिए, समुदाय ने डिजिटल संपत्ति को "XRP" कहना शुरू कर दिया।

source: By June 2012, Schwartz, McCaleb and Britto completed code development and the XRP Ledger was fully functioning.
hi: जून 2012 तक, श्वार्ट्ज, मैककेलेब और ब्रिटो ने कोड विकास पूरा कर लिया और एक्सआरपी लेजर पूरी तरह से काम कर रहा था।

source: At that time, they decided their next move would be to gift 80 billion XRP to a not-yet-formed private company that would work with the broader community as well as pursue its own payments mission. The ledger code itself would be open source and for anyone to use.
hi: उस समय, उन्होंने फैसला किया कि उनका अगला कदम 80 बिलियन एक्सआरपी को एक अभी तक गठित निजी कंपनी को उपहार में देना होगा जो व्यापक समुदाय के साथ काम करेगी और साथ ही अपने स्वयं के भुगतान मिशन को आगे बढ़ाएगी। लेज़र कोड स्वयं खुला स्रोत होगा और किसी के भी उपयोग के लिए होगा।

source: They all agreed on how to allocate the XRP among themselves and the future company, and they eventually created the company along with Chris Larsen in September 2012.
hi: वे सभी इस बात पर सहमत हुए कि एक्सआरपी को आपस में और भविष्य की कंपनी के बीच कैसे आवंटित किया जाए, और उन्होंने अंततः सितंबर 2012 में क्रिस लार्सन के साथ कंपनी बनाई।

source: Once the XRP Ledger was fully functioning, 80&#37; of the XRP was gifted to the company—initially called NewCoin and renamed quickly to OpenCoin.
hi: एक बार एक्सआरपी लेजर पूरी तरह से काम कर रहा था, 80&#37; XRP का उपहार कंपनी को उपहार में दिया गया था - शुरू में इसे NewCoin कहा जाता था और जल्दी से इसका नाम बदलकर OpenCoin कर दिया गया।

source: Chris Larsen was the CEO of OpenCoin, and at the company's founding, Jed was co-founder and CTO, David Schwartz was the Chief Cryptography Officer, and Arthur Britto an advisor.
hi: क्रिस लार्सन ओपनकॉइन के सीईओ थे, और कंपनी की स्थापना में, जेड सह-संस्थापक और सीटीओ थे, डेविड श्वार्ट्ज मुख्य क्रिप्टोग्राफी अधिकारी थे, और आर्थर ब्रिटो एक सलाहकार थे।

source: 2013 OpenCoin Rebranded To Ripple Labs
hi: 2013 ओपनकॉइन को रिपल लैब्स में रीब्रांड किया गया

source: At the outset of the company, OpenCoin set out to revolutionize the global financial system. Despite the revolutionary ideals of many of Bitcoin’s early believers, Larsen never thought blockchain technology should be used to overthrow the existing financial system. He believed that history’s most transformative innovations have always relied on the great ideas that came before them—not disrupting them.
hi: कंपनी की शुरुआत में, OpenCoin ने वैश्विक वित्तीय प्रणाली में क्रांति लाने की शुरुआत की। बिटकॉइन के शुरुआती विश्वासियों के क्रांतिकारी आदर्शों के बावजूद, लार्सन ने कभी नहीं सोचा था कि मौजूदा वित्तीय प्रणाली को उखाड़ फेंकने के लिए ब्लॉकचेन तकनीक का इस्तेमाल किया जाना चाहिए। उनका मानना ​​​​था कि इतिहास के सबसे परिवर्तनकारी नवाचारों ने हमेशा उनके सामने आए महान विचारों पर भरोसा किया है - उन्हें बाधित नहीं किया है।

source: In early conversations with potential customers, the team was asked about the differences between the Ripple project and OpenCoin company. With the community starting to call the digital asset by its currency code "XRP" more widely, company leaders decided to rebrand the company to Ripple Labs, which has been shortened over time to "Ripple."
hi: संभावित ग्राहकों के साथ शुरुआती बातचीत में, टीम से रिपल प्रोजेक्ट और ओपनकॉइन कंपनी के बीच अंतर के बारे में पूछा गया था। समुदाय ने डिजिटल एसेट को अपने मुद्रा कोड XRP द्वारा अधिक व्यापक रूप से कॉल करना शुरू कर दिया, कंपनी के नेताओं ने कंपनी को Ripple Labs में रीब्रांड करने का निर्णय लिया, जिसे समय के साथ Ripple में छोटा कर दिया गया।

source: Today, the company uses XRP and the XRP Ledger for liquidity management in its cross-border payments business. Ripple also remains a stakeholder and contributor to the broader XRP community.
hi: आज, कंपनी अपने सीमा-पार भुगतान व्यवसाय में तरलता प्रबंधन के लिए XRP और XRP लेजर का उपयोग करती है। रिपल भी व्यापक एक्सआरपी समुदाय में एक हितधारक और योगदानकर्ता बना हुआ है।

source: Podcast
hi: पॉडकास्ट

source: How Digital Assets Will Help Create a Sustainable Global Economy
hi: कैसे डिजिटल संपत्ति एक सतत वैश्विक अर्थव्यवस्था बनाने में मदद करेगी

source: Hear from Ripple co-founder Chris Larsen in the inaugural episode of the Block Stars podcast.
hi: ब्लॉक स्टार्स पॉडकास्ट के उद्घाटन एपिसोड में रिपल के सह-संस्थापक क्रिस लार्सन से सुनें।

source: Listen Now
hi: सुनो अब

source: Faster, Cheaper, Green Money
hi: तेज़, सस्ता, हरा धन

source: Impact
hi: प्रभाव

source: The digital asset XRP is a truly global currency—ideally suited to enable today’s growing digital economy.
hi: डिजिटल संपत्ति एक्सआरपी वास्तव में एक वैश्विक मुद्रा है-आज की बढ़ती डिजिटल अर्थव्यवस्था को सक्षम करने के लिए आदर्श रूप से उपयुक्त है।

source: As an optimal medium of exchange, XRP and the XRP Ledger on which it operates help to move money around the world faster, cheaper and more sustainably than any other currency available today.
hi: एक्सचेंज के इष्टतम माध्यम के रूप में, एक्सआरपी और एक्सआरपी लेजर, जिस पर यह संचालित होता है, आज उपलब्ध किसी भी अन्य मुद्रा की तुलना में दुनिया भर में तेजी से, सस्ता और अधिक स्थायी रूप से पैसा स्थानांतरित करने में मदद करता है।

source: It was designed this way, and it’s proving its impact in global payments and beyond.
hi: इसे इस तरह से डिजाइन किया गया था, और यह वैश्विक भुगतान और उससे आगे के प्रभाव को साबित कर रहा है।

source: Global Payments
hi: वैश्विक भुगतान

source: Creating Economic Opportunity
hi: आर्थिक अवसर बनाना

source: For the more than <a href="https://www.un.org/sites/un2.un.org/files/wmr_2020.pdf" target="_blank">272 million migrants</a> worldwide, sending and receiving money across borders is expensive, unreliable and complex.
hi: दुनिया भर में <a href=https://www.un.org/sites/un2.un.org/files/wmr_2020.pdf target=_blank>272 मिलियन प्रवासियों</a> से अधिक के लिए, भेजने और सीमाओं के पार धन प्राप्त करना महंगा, अविश्वसनीय और जटिल है।

source: XRP and the XRP Ledger are changing that.
hi: एक्सआरपी और एक्सआरपी लेजर इसे बदल रहे हैं।

source: The technology has been adopted by financial institutions around the world. They use it to source liquidity for international transactions, and because of the unprecedented efficiency it offers, they’re able to both bring down costs and improve services.
hi: प्रौद्योगिकी को दुनिया भर के वित्तीय संस्थानों द्वारा अपनाया गया है। वे इसका उपयोग अंतरराष्ट्रीय लेनदेन के लिए तरलता के स्रोत के लिए करते हैं, और इसकी अभूतपूर्व दक्षता के कारण, वे लागत कम करने और सेवाओं में सुधार करने में सक्षम हैं।

source: This means hundreds of millions of people worldwide who need to move money safely and securely across borders can do so more affordably and reliably than ever before.
hi: इसका मतलब यह है कि दुनिया भर में करोड़ों लोग जिन्हें सीमाओं के पार सुरक्षित और सुरक्षित रूप से धन स्थानांतरित करने की आवश्यकता है, वे पहले से कहीं अधिक किफायती और मज़बूती से ऐसा कर सकते हैं।

source: Future of Finance
hi: वित्त का भविष्य

source: Building for the Future
hi: भविष्य के लिए भवन

source: Digital assets and blockchain technology are the future of finance. Open and decentralized, they offer the first-ever global standards for value exchange broadly—whether it’s money, stocks, loyalty points, intellectual property or more.
hi: डिजिटल संपत्ति और ब्लॉकचेन तकनीक वित्त का भविष्य हैं। खुले और विकेंद्रीकृत, वे व्यापक रूप से मूल्य विनिमय के लिए पहले वैश्विक मानकों की पेशकश करते हैं-चाहे वह पैसा, स्टॉक, वफादारी अंक, बौद्धिक संपदा या अधिक हो।

source: This has spawned increasing adoption of the technology across the financial services industry, from retail and institutional investment to commercial use cases like cross-border payments.
hi: इसने वित्तीय सेवा उद्योग में खुदरा और संस्थागत निवेश से लेकर सीमा पार से भुगतान जैसे व्यावसायिक उपयोग के मामलों में प्रौद्योगिकी को अपनाने में वृद्धि की है।

source: With usage growing, it’s critical that measures are taken today to ensure that the technology is environmentally sustainable tomorrow.
hi: उपयोग बढ़ने के साथ, यह महत्वपूर्ण है कि यह सुनिश्चित करने के लिए आज उपाय किए जाएं कि प्रौद्योगिकी कल पर्यावरण की दृष्टि से टिकाऊ हो।

source: Digital Assets
hi: डिजिटल संपत्ति

source: Are All Digital Assets Alike?
hi: क्या सभी डिजिटल एसेट एक जैसे हैं?

source: Each digital asset has different strengths that make it ideal for various use cases today.
hi: प्रत्येक डिजिटल संपत्ति में अलग-अलग ताकत होती है जो इसे आज के विभिन्न उपयोग के मामलों के लिए आदर्श बनाती है।

source: Bitcoin is recognized broadly as a store of value and ether (ETH) for use in smart contracts.
hi: बिटकॉइन को मोटे तौर पर स्मार्ट अनुबंधों में उपयोग के लिए मूल्य और ईथर (ETH) के भंडार के रूप में मान्यता प्राप्त है।

source: XRP is optimal for transacting—it’s fast, cheap, scalable and energy-efficient. It was designed for use in global payments.
hi: XRP लेन-देन के लिए इष्टतम है - यह तेज़, सस्ता, स्केलेबल और ऊर्जा-कुशल है। इसे वैश्विक भुगतान में उपयोग के लिए डिज़ाइन किया गया था।

source: And, the same characteristics that make it ideal for payments mean it’s also better for our environment. XRP is green by nature.
hi: और, वही विशेषताएं जो इसे भुगतान के लिए आदर्श बनाती हैं, इसका मतलब है कि यह हमारे पर्यावरण के लिए भी बेहतर है। एक्सआरपी स्वभाव से हरा है।

source: What Makes XRP and the XRP Ledger Green?
hi: एक्सआरपी और एक्सआरपी लेजर ग्रीन क्या बनाता है?

source: Most currency today—whether digital or physical—is not environmentally friendly. The potential long-term impact on our planet could hold startling consequences.
hi: आज अधिकांश मुद्रा - चाहे डिजिटल हो या भौतिक - पर्यावरण के अनुकूल नहीं है। हमारे ग्रह पर संभावित दीर्घकालिक प्रभाव के चौंकाने वाले परिणाम हो सकते हैं।

source: The digital asset XRP was designed with sustainability in mind. The XRP Ledger processes transactions through a unique “consensus” mechanism that consumes negligible energy and all XRP currency is already in circulation. It is the first major blockchain network to be <a href="https://ripple.com/ripple-press/ripple-leads-sustainability-agenda-to-achieve-carbon-neutrality-by-2030/" target="_blank">fully carbon neutral</a>.
hi: डिजिटल संपत्ति एक्सआरपी को स्थिरता को ध्यान में रखकर डिजाइन किया गया था। एक्सआरपी लेजर एक अद्वितीय "आम सहमति" तंत्र के माध्यम से लेनदेन की प्रक्रिया करता है जो नगण्य ऊर्जा की खपत करता है और सभी एक्सआरपी मुद्रा पहले से ही प्रचलन में है। यह पहला प्रमुख ब्लॉकचेन नेटवर्क है जो <a href=https://ripple.com/ripple-press/ripple-leads-sustainability-agenda-to-achieve-carbon-neutrality-by-2030/ target= _blank>पूरी तरह से कार्बन न्यूट्रल</a>.

source: Other digital assets, like Bitcoin, rely on a different mechanism to both validate transactions and create new coins. This “proof-of-work” algorithm requires “mining.” Mining is an incredibly energy-intensive process for validating transactions that consumes more energy in a year than entire countries.
hi: अन्य डिजिटल संपत्ति, जैसे बिटकॉइन, लेनदेन को मान्य करने और नए सिक्के बनाने के लिए एक अलग तंत्र पर भरोसा करते हैं। इस "प्रूफ-ऑफ-वर्क" एल्गोरिथम के लिए "खनन" की आवश्यकता होती है। पूरे देशों की तुलना में एक वर्ष में अधिक ऊर्जा की खपत करने वाले लेनदेन को मान्य करने के लिए खनन एक अविश्वसनीय रूप से ऊर्जा-गहन प्रक्रिया है।

source: Cash also leaves a substantial carbon footprint, and the environmental impact goes beyond energy consumption—eutrophication (due to waste), photochemical ozone creation, greenhouse gas emissions and more factor into the equation.
hi: नकद भी एक पर्याप्त कार्बन पदचिह्न छोड़ देता है, और पर्यावरणीय प्रभाव ऊर्जा खपत से परे चला जाता है-यूट्रोफिकेशन (अपशिष्ट के कारण), फोटोकैमिकल ओजोन निर्माण, ग्रीनहाउस गैस उत्सर्जन और समीकरण में अधिक कारक।

source: Adopting XRP more broadly will help limit this waste and ensure a sustainable future for our planet and global economy.
hi: एक्सआरपी को अधिक व्यापक रूप से अपनाने से इस कचरे को सीमित करने और हमारे ग्रह और वैश्विक अर्थव्यवस्था के लिए एक स्थायी भविष्य सुनिश्चित करने में मदद मिलेगी।

source: Discover the Green Currency Calculator
hi: ग्रीन करेंसी कैलकुलेटर की खोज करें

source: XRP Overview
hi: एक्सआरपी अवलोकन

source: Your Questions About XRP, Answered.
hi: एक्सआरपी के बारे में आपके प्रश्न, उत्तर दिए गए।

source: XRP is a digital asset that’s native to the XRP Ledger, an open-source, permissionless and decentralized <a href="https://www.distributedagreement.com/2018/09/24/what-is-a-blockchain/" target="_blank">blockchain technology</a>.
hi: एक्सआरपी एक डिजिटल संपत्ति है जो एक्सआरपी लेजर के मूल निवासी है, एक खुला स्रोत, अनुमति रहित और विकेंद्रीकृत <a href=https://www.distributedagreement.com/2018/09/24/what-is-a-blockchain/ target=_blank>ब्लॉकचैन तकनीक</a>.

source: Created in 2012 specifically for payments, XRP can settle transactions on the ledger in 3-5 seconds. It was built to be a better Bitcoin—faster, cheaper and greener than any other digital asset.
hi: 2012 में विशेष रूप से भुगतान के लिए बनाया गया, XRP 3-5 सेकंड में खाता बही पर लेनदेन का निपटान कर सकता है। यह किसी भी अन्य डिजिटल संपत्ति की तुलना में बेहतर बिटकॉइन-तेज, सस्ता और हरित होने के लिए बनाया गया था।

source: Benefits
hi: लाभ

source: XRP
hi: एक्सआरपी

source: 3-5 seconds to settle
hi: 3-5 सेकंड बसने के लिए

source: 500 seconds to settle
hi: सेटल होने के लिए 500 सेकंड

source: $0.0002/transaction
hi: $0.0002/लेनदेन

source: $0.50/transaction
hi: $0.50/लेनदेन

source: 1,500 transactions per second
hi: प्रति सेकंड 1,500 लेनदेन

source: 3 transactions per second
hi: प्रति सेकंड 3 लेनदेन

source: Environmentally sustainable and carbon neutral
hi: पर्यावरण की दृष्टि से टिकाऊ और कार्बन न्यूट्रल

source: 0.3&#37; of global energy consumption
hi: 0.3&#37; वैश्विक ऊर्जा खपत का

source: Finite Supply of XRP
hi: एक्सआरपी की सीमित आपूर्ति

source: XRP can be sent directly without needing a central intermediary, making it a convenient instrument in bridging two different currencies quickly and efficiently. It is freely exchanged on the open market and used in the real world for enabling cross-border payments and microtransactions.
hi: एक्सआरपी को केंद्रीय मध्यस्थ की आवश्यकता के बिना सीधे भेजा जा सकता है, जिससे यह दो अलग-अलग मुद्राओं को जल्दी और कुशलता से पाटने में एक सुविधाजनक साधन बन जाता है। खुले बाजार में इसका स्वतंत्र रूप से आदान-प्रदान किया जाता है और वास्तविक दुनिया में सीमा पार से भुगतान और सूक्ष्म लेनदेन को सक्षम करने के लिए उपयोग किया जाता है।

source: Unlike Bitcoin, there is a finite amount of XRP. All XRP is already in existence today—100 billion in total.
hi: बिटकॉइन के विपरीत, एक्सआरपी की एक सीमित मात्रा है। आज सभी एक्सआरपी पहले से मौजूद हैं—कुल मिलाकर 100 अरब।

source: History of XRP
hi: एक्सआरपी का इतिहास

source: How Does the XRP Ledger Work?
hi: एक्सआरपी लेजर कैसे काम करता है?

source: The XRP Ledger is open-source technology on which anyone can build. The XRP Ledger is maintained by a global “XRP Community”—a diverse set of participants composed of software engineers, server operators and <a href="run-a-rippled-validator.html">validators</a>.
hi: एक्सआरपी लेजर ओपन-सोर्स तकनीक है जिस पर कोई भी निर्माण कर सकता है। XRP लेजर को एक वैश्विक "XRP समुदाय" द्वारा बनाए रखा जाता है - सॉफ्टवेयर इंजीनियरों, सर्वर ऑपरेटरों और <a href=un-a-rippled-validator.html>validators</a> से बना प्रतिभागियों का एक विविध समूह।

source: The XRP Ledger uses a consensus protocol, in which validators come to an agreement on the order of XRP transactions every 3-5 seconds. This agreement serves as the final and irreversible settlement.
hi: एक्सआरपी लेजर एक आम सहमति प्रोटोकॉल का उपयोग करता है, जिसमें सत्यापनकर्ता हर 3-5 सेकंड में एक्सआरपी लेनदेन के आदेश पर एक समझौते पर आते हैं। यह समझौता अंतिम और अपरिवर्तनीय निपटान के रूप में कार्य करता है।

source: Transactions are executed in a deterministic order to prevent double spending and malicious activity. Unlike other blockchains, transaction fees are destroyed as part of transaction execution. The XRP Ledger adjusts fees in near real time to respond to network conditions, with the twin goals of maximizing transaction throughput while keeping transaction fees as low as possible.
hi: दोहरे खर्च और दुर्भावनापूर्ण गतिविधि को रोकने के लिए लेन-देन एक नियतात्मक क्रम में निष्पादित किए जाते हैं। अन्य ब्लॉकचेन के विपरीत, लेन-देन निष्पादन के हिस्से के रूप में लेनदेन शुल्क नष्ट हो जाते हैं। XRP लेजर नेटवर्क स्थितियों का जवाब देने के लिए लगभग वास्तविक समय में शुल्क को समायोजित करता है, लेन-देन शुल्क को यथासंभव कम रखते हुए लेनदेन थ्रूपुट को अधिकतम करने के दोहरे लक्ष्यों के साथ।

source: All servers in the network process each transaction according to the same rules, and any transaction that follows the protocol is confirmed as soon as validators reach a quorum.
hi: नेटवर्क में सभी सर्वर समान नियमों के अनुसार प्रत्येक लेनदेन को संसाधित करते हैं, और जैसे ही सत्यापनकर्ता कोरम तक पहुंचते हैं, प्रोटोकॉल का पालन करने वाले किसी भी लेनदेन की पुष्टि की जाती है।

source: XRP Validators
hi: एक्सआरपी सत्यापनकर्ता

source: Anyone can operate a validator; currently, over 150 <a href="run-a-rippled-validator.html" class="underline">validators</a> are active on the ledger, operated by universities, exchanges, businesses and individuals.
hi: कोई भी सत्यापनकर्ता संचालित कर सकता है; वर्तमान में, 150 से अधिक <a href=un-a-rippled-validator.html class=underline>सत्यापनकर्ता</a> विश्वविद्यालय, एक्सचेंजों, व्यवसायों और व्यक्तियों द्वारा संचालित बहीखाता पर सक्रिय हैं।

source: Get Technical
hi: तकनीकी प्राप्त करें

source: Why Is XRP Useful?
hi: एक्सआरपी क्यों उपयोगी है?

source: XRP is fast, low-cost, sustainable and scalable. It is the key to fueling growth and realizing the true potential of our global economy—the <a href="https://ripple.com/insights/the-internet-of-value-what-it-means-and-how-it-benefits-everyone/" target="_blank" class="underline">Internet of Value</a>.
hi: एक्सआरपी तेज, कम लागत वाला, टिकाऊ और स्केलेबल है। यह विकास को बढ़ावा देने और हमारी वैश्विक अर्थव्यवस्था की वास्तविक क्षमता को साकार करने की कुंजी है—<a href=https://ripple.com/insights/the-internet-of-value-what-it-means-and-how -it-benefits-everyone/ target=_blank class=underline>इंटरनेट ऑफ वैल्यू</a>।

source: Businesses
hi: व्यवसायों

source: Many businesses are building on the XRP Ledger, pursuing powerful use cases in decentralized finance, micropayments, gaming, web monetization and more. Additionally, Ripple, the technology company, is focused on building a network and infrastructure that leverages XRP to power faster, more affordable cross-border payments around the world.
hi: कई व्यवसाय एक्सआरपी लेजर पर निर्माण कर रहे हैं, विकेंद्रीकृत वित्त, सूक्ष्म भुगतान, गेमिंग, वेब मुद्रीकरण और अधिक में शक्तिशाली उपयोग के मामलों का पीछा कर रहे हैं। इसके अतिरिक्त, रिपल, प्रौद्योगिकी कंपनी, एक नेटवर्क और बुनियादी ढांचे के निर्माण पर ध्यान केंद्रित कर रही है जो दुनिया भर में तेजी से, अधिक किफायती सीमा पार से भुगतान करने के लिए एक्सआरपी का लाभ उठाती है।

source: More About Businesses
hi: व्यवसायों के बारे में अधिक

source: Individuals
hi: व्यक्तियों
